<template>
  <div class="page">
    <Tabs>
        <TabPane label="总分" name="name1">
          <echarts-box width="100%" height="400px" :value="all"></echarts-box>
        </TabPane>
        <TabPane label="语文学科" name="name2">
          <echarts-box width="100%" height="400px" :value="yuwen"></echarts-box>
        </TabPane>
        <TabPane label="数学学科" name="name3">
          <echarts-box width="100%" height="400px" :value="shuxue"></echarts-box>
        </TabPane>
        <TabPane label="英语学科" name="name4">
          <echarts-box width="100%" height="400px" :value="yinyu"></echarts-box>
        </TabPane>
        <TabPane label="政治学科" name="name5">
          <echarts-box width="100%" height="400px" :value="zhengzhi"></echarts-box>
        </TabPane>
        <TabPane label="历史学科" name="name6">
          <echarts-box width="100%" height="400px" :value="lishi"></echarts-box>
        </TabPane>
        <TabPane label="地理学科" name="name7">
          <echarts-box width="100%" height="400px" :value="dili"></echarts-box>
        </TabPane>
        <TabPane label="物理学科" name="name8">
          <echarts-box width="100%" height="400px" :value="wuli"></echarts-box>
        </TabPane>
        <TabPane label="化学学科" name="name9">
          <echarts-box width="100%" height="400px" :value="huaxue"></echarts-box>
        </TabPane>
        <TabPane label="生物学科" name="name10">
          <echarts-box width="100%" height="400px" :value="shengwu"></echarts-box>
        </TabPane>
    </Tabs>
  </div>
</template>

<script>
export default {
  data () {
    return {

      all: {
        type: 'scatter',
        option: {
          title: ['经开区', '管城区', '二七区', '惠济区', '中原区', '高新区', '金水区', '郑东新区', '市直'],
          data: [[50.72, 0.474440541], [50.03, 0.49543164], [49.67, 0.45358486], [49.64, 0.417246908], [49.52, 0.411189149], [49.44, 0.483195212], [49.27, 0.455241861], [49.03, 0.458424773], [46.72, 0.427905349]]
        }
      },

      yuwen: {
        type: 'scatter',
        option: {
          title: ['经开区', '管城区', '二七区', '惠济区', '中原区', '高新区', '金水区', '郑东新区', '市直'],
          data: [[51.04, 0.468666507], [50.13, 0.473603916], [49.7, 0.445612847], [49.63, 0.426675714], [49.52, 0.428945029], [49.86, 0.484121903], [49.14, 0.460705929], [49.25, 0.451201279], [47.05, 0.428968777]]
        }
      },

      shuxue: {
        type: 'scatter',
        option: {
          title: ['经开区', '管城区', '二七区', '惠济区', '中原区', '高新区', '金水区', '郑东新区', '市直'],
          data: [[50.33, 0.485761856], [50, 0.482415938], [49.59, 0.46234159], [49.66, 0.42121921], [49.45, 0.415790748], [49.56, 0.480496878], [49.31, 0.452932218], [48.86, 0.450929665], [47.13, 0.435557688]]
        }
      },

      yinyu: {
        type: 'scatter',
        option: {
          title: ['经开区', '管城区', '二七区', '惠济区', '中原区', '高新区', '金水区', '郑东新区', '市直'],
          data: [[51.14, 0.464341098], [50.13, 0.481012444], [49.67, 0.460373228], [49.87, 0.408851543], [49.5, 0.408274327], [48.81, 0.46180435], [49.19, 0.456575644], [48.98, 0.449995159], [46.45, 0.421686377]]
        }
      },

      zhengzhi: {
        type: 'scatter',
        option: {
          title: ['经开区', '管城区', '二七区', '惠济区', '中原区', '高新区', '金水区', '郑东新区', '市直'],
          data: [[50.7, 0.474105297], [50.24, 0.472011671], [50.07, 0.456928554], [49.61, 0.413621088], [49.19, 0.419175303], [49.7, 0.471355264], [49.27, 0.463757699], [49.29, 0.469513642], [47.23, 0.423688349]]
        }
      },

      lishi: {
        type: 'scatter',
        option: {
          title: ['经开区', '管城区', '二七区', '惠济区', '中原区', '高新区', '金水区', '郑东新区', '市直'],
          data: [[50.33, 0.477415379], [50.24, 0.475740783], [49.66, 0.457051273], [49.45, 0.426210396], [49.06, 0.407632684], [49.31, 0.471741141], [49.12, 0.460520644], [49.39, 0.472513441], [48.05, 0.430786709]]
        }
      },
      dili: {
        type: 'scatter',
        option: {
          title: ['经开区', '管城区', '二七区', '惠济区', '中原区', '高新区', '金水区', '郑东新区', '市直'],
          data: [[50.55, 0.479434714], [49.72, 0.459815036], [49.86, 0.446447571], [49.65, 0.43736709], [49.54, 0.417725652], [49.64, 0.485161942], [49.42, 0.465454145], [49.35, 0.46820171], [47.25, 0.422099952]]
        }
      },

      wuli: {
        type: 'scatter',
        option: {
          title: ['经开区', '管城区', '二七区', '惠济区', '中原区', '高新区', '金水区', '郑东新区', '市直'],
          data: [[49.55, 0.484078883], [49.79, 0.461620038], [50.29, 0.451865393], [50.3, 0.425316572], [49.78, 0.404982824], [48.73, 0.474611087], [49.16, 0.448860695], [50.14, 0.445434007], [46.76, 0.429645047]]
        }
      },

      huaxue: {
        type: 'scatter',
        option: {
          title: ['中原区', '郑东新区', '市直属', '经开区', '金水区', '惠济区', '管城区', '高新区', '二七区'],
          data: [[48.95, 0.446], [49.5, 0.457], [47.64, 0.434], [49.97, 0.477], [50.26, 0.476], [49.98, 0.469], [50.13, 0.504], [50.75, 0.467], [49.54, 0.467]]
        }
      },

      shengwu: {
        type: 'scatter',
        option: {
          title: ['经开区', '管城区', '二七区', '惠济区', '中原区', '高新区', '金水区', '郑东新区', '市直'],
          data: [[50.53, 0.48042926], [49.73, 0.460555196], [49.72, 0.452254958], [49.76, 0.426889909], [49.51, 0.419175447], [49.62, 0.479357426], [49.1, 0.436954583], [49.44, 0.475528035], [47.45, 0.427150835]]
        }
      }

    }
  }
}
</script>

<style lang="scss" scoped>
.page{
  font-size: 14px;
}
</style>
